Tekla Open API Reference for Tekla Structures 2025
Connection Constructor
 Creates a new connection instance.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Connection()
Public Sub New
See Also
Reference
Connection Class
Tekla.Structures.Model Namespace